{
  "usuarios": [
    {
      "usuario": "root",
      "nombre": "root",
      "correo": "root",
      "tema": "dark",
      "carrito": []
    },
    {
      "usuario": "Yodak025",
      "nombre": "DSOTA",
      "email": "diego.sota%40gmail.com",
      "tema": "default",
      "carrito": []
    }
  ],
  "productos": [
    {
      "nombre": "dev",
      "categoria": "null",
      "titulo": "null",
      "componente": "ProductPage"
    },
    {
      "nombre": "curriculum-vitae",
      "categoria": "documentos-laborales",
      "titulo": "Currículum Vitae Personalizado",
      "componente": "CV"
    },
    {
      "nombre": "carta-presentacion",
      "categoria": "documentos-laborales",
      "titulo": "Carta de Presentación",
      "componente": "CoverLetter"
    },
    {
      "nombre": "resumen-ejecutivo",
      "categoria": "documentos-laborales",
      "titulo": "Resumen Ejecutivo",
      "componente": "ExecutiveSummary"
    },
    {
      "nombre": "descripcion-producto",
      "categoria": "documentos-laborales",
      "titulo": "Descripción de Producto",
      "componente": "ProductDescription"
    },
    {
      "nombre": "email-ventas",
      "categoria": "documentos-laborales",
      "titulo": "Email de Ventas",
      "componente": "SalesEmail"
    },
    {
      "nombre": "carta-recomendacion",
      "categoria": "documentos-laborales",
      "titulo": "Carta de Recomendación",
      "componente": "RecommendationLetter"
    },
    {
      "nombre": "revisar-redaccion",
      "categoria": "editor",
      "titulo": "Revisar Redacción",
      "componente": "Review"
    },
    {
      "nombre": "resumir-texto",
      "categoria": "editor",
      "titulo": "Resumir Texto",
      "componente": "Summarize"
    },
    {
      "nombre": "esquematizar-texto",
      "categoria": "editor",
      "titulo": "Esquematizar Texto",
      "componente": "Schematize"
    },
    {
      "nombre": "extender-texto",
      "categoria": "editor",
      "titulo": "Extender Texto",
      "componente": "Extend"
    },
    {
      "nombre": "prensar-latex",
      "categoria": "editor",
      "titulo": "Prensar Texto",
      "componente": "Latex"
    }
  ],
  "pedidos": [
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T16:44:59.190Z",
      "dirección": "esrebollo@gmail.com",
      "tarjeta": "sasasasasasasasa",
      "documentos": [
        {},
        {},
        {},
        {}
      ]
    },
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T16:54:20.294Z",
      "dirección": "as@sd.d",
      "tarjeta": "ssdsddssdsdsdsds",
      "documentos": [
        {},
        {},
        {},
        {}
      ]
    },
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T16:56:01.835Z",
      "dirección": "d.sota.2020@alumnos.urjc.es",
      "tarjeta": "ssdsddssdsdsdsds",
      "documentos": [
        {},
        {},
        {},
        {}
      ]
    },
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T16:57:32.502Z",
      "dirección": "diego.sota@gmail.com",
      "tarjeta": "11111212121212121212",
      "documentos": [
        {
          "tipo": "resumir-texto",
          "cuerpo": {
            "Texto Resumido": "\"Desafortunadamente, no se puede generar un resumen del texto original debido a que no es posible analizar su contenido ya que consta solo de caracteres aleatorios sin sentido.\\n\\nSin embargo, puedo sugerirte una posible forma de abordar este problema:\\n\\n1. Reemplaza el texto original con un mensaje de error o una solicitud para que el usuario ingrese un texto válido.\\n2. Puedes generar un resumen vacío o un mensaje indicando que no se puede analizar el texto debido a su contenido.\\n\\nAquí te muestro un posible resultado:\\n\\nel texto ingresado es inválido, por favor ingresa un texto real para poder realizar la análisis y generar un resumen adecuado.\\n\\nSi deseas, puedo sugerirte una forma de mejorar tu aplicación para que pueda manejar textos vacíos o con contenido no válido.\""
          }
        },
        {
          "tipo": "esquematizar-texto",
          "cuerpo": {
            "Esquema Generado": "\"1. cvcvcvc\\n2. cvdcvcvcvcv\\n3. \\n4. cvcvcvc\\n5. 1. cvcvcvcvcv\\n6. 1.1. cvcvcvc\\n7. 1.1.1. cvcvcvcvc\\n8. 1.1.2. cvcvcvcv\\n9. 1.2. cvcvcvcvcv\\n10. cvdcvcvcv\""
          }
        },
        {
          "tipo": "revisar-redaccion",
          "cuerpo": {
            "Corrección de Texto": {
              "Texto Corregido": "\"El texto original no tiene sentido y parece ser un conjunto aleatorio de caracteres. No hay estructura ni contenido claro que pueda ser resumido.\""
            },
            "Feedback": "\"¡Claro! Aquí te presento mi feedback sobre el texto original:\\n\\nMe parece que el texto está bien estructurado y fácil de leer, pero hay algunas cosas que podrían mejorarse. En primer lugar, la ortografía y gramática están correctas, lo cual es genial.\\n\\nSin embargo, noté que hay algunos conceptos que se repiten en diferentes partes del texto. Podrías considerar crear una estructura más lógica y jerárquica para que el contenido sea más fácil de seguir.\\n\\nTambién me parece que algunas frases son un poco largas y difíciles de entender. Procura dividirlas en oraciones más cortas y sencillas para que sean más fáciles de leer.\\n\\nEn cuanto a la coherencia, hay algunos puntos que no están claramente relacionados entre sí. Podrías considerar crear una estructura de ideas más lógica y conexiva.\\n\\nOtra cosa que me parece interesante es agregar un poco de variedad en el lenguaje. Aunque el tono es informal y coloquial, algunas frases son un poco genéricas y podrían ser reemplazadas con algo más original.\\n\\nFinalmente, no te olvides de revisar la consistencia en la puntuación y el uso de comas, puntos suspensivos, etc. Aunque no es un error grave, puede afectar la lectura del texto.\\n\\nEn resumen, el texto tiene buenos y malos puntos. Con algunas mejoras en la estructura, coherencia y lenguaje, podría ser aún más efectivo y atractivo para los usuarios.\""
          }
        },
        {
          "tipo": "resumir-texto",
          "cuerpo": {
            "Texto Resumido": "\"El texto original no parece contener ninguna información coherente ni significativa. Sin embargo, puedo intentar analizarlo y generar un resumen basado en la longitud del texto.\\n\\nSi el texto original tiene una longitud de 20 caracteres, entonces el resumen debe tener aproximadamente 5 caracteres.\\n\\ncvcv\\n\\nPero si consideramos que el texto es solo un conjunto aleatorio de caracteres, no hay puntos clave ni conceptos que resumir. \\n\\nEntonces, el resumen podría ser simplemente un mensaje indicando que el texto original no contiene información útil.\\n\\ncvcvv\""
          }
        }
      ]
    },
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T17:47:44.140Z",
      "dirección": "diego.sota@gmail.com",
      "tarjeta": "11111212121212121212",
      "documentos": [
        {
          "tipo": "resumir-texto",
          "cuerpo": {
            "Texto Resumido": "\"Desafortunadamente, no se puede generar un resumen del texto original ya que parece ser una cadena aleatoria sin sentido.\\n\\nSin embargo, si asumimos que la cadena \\\"ijidjeneunfuenfuenfef\\\" es solo un ejemplo y que el texto original es un conjunto de ideas o conceptos reales, podemos intentar analizar la cadena para extraer algunas características generales.\\n\\nAquí te presento un posible resumen del texto en formato plano:\\n\\nno hay información en el texto original\\nno se pueden identificar conceptos o ideas claras\\nla cadena parece ser aleatoria y sin sentido\\n\\nSi necesitas ayuda con otro texto, por favor proporciona el texto real y yo estaré encantado de ayudarte a generar un resumen.\""
          }
        },
        {
          "tipo": "esquematizar-texto",
          "cuerpo": {
            "Esquema Generado": "\"1\\n2\\n3\\n4\\n5\\n6\\n7\\n8\\n9\\n10\\n11\\n12\\n13\\n14\\n15\\n16\\n17\\n18\\n19\\n20\\n\\n1. cvcvcvcvcv\\n2. cvdcvcvcvcv\\n3. cvcvcvcvcv\\n4. cvcvcvcvcv\\n5. cvcvcvcvcv\\n6. cvcvcvcvcv\\n7. cvcvcvcvcv\\n8. cvcvcvcvcv\""
          }
        },
        {
          "tipo": "revisar-redaccion",
          "cuerpo": {
            "Corrección de Texto": {
              "Texto Corregido": "\"No hay nada que resumir, parece que se proporcionó un texto vacío. Si deseas generar un resumen de algo específico, por favor proporciona el texto completo y yo estaré encantado de ayudarte.\""
            },
            "Feedback": "\"¡Claro! A continuación te presento un feedback constructivo sobre el texto proporcionado:\\n\\nEl texto parece ser una mezcla de ideas y conceptos interesantes, pero podría beneficiarse de algunas mejoras para que se sienta más fluido y fácil de leer.\\n\\nPrimero, es importante destacar que hay algunos errores de gramática y ortografía en el texto. Por ejemplo, en la oración \\\"El usuario puede generar contenido de forma automática\\\" debería decir \\\"El usuario puede generar contenido de manera automática\\\". También hay algunas palabras mal escritas como \\\"coloquial\\\" en lugar de \\\"colloquial\\\".\\n\\nEn cuanto al tono, creo que se está más cerca del formal que del informal. Para lograr un tono coloquial y cercano es importante utilizar un lenguaje más relajado y natural. Por ejemplo, en lugar de decir \\\"La aplicación web ayudará a los usuarios\\\" podría decirse \\\"Con nuestra app podrás generar contenido sin problemas\\\".\\n\\nOtra sugerencia que tengo es que el texto sea más conciso y directo. Hay algunas oraciones largas y complejas que pueden ser divididas en párrafos más cortos y fáciles de leer.\\n\\nFinalmente, me parece que el texto podría beneficiarse de algunos ejemplos o ilustraciones para hacerlo más atractivo y comprensible para los lectores. ¿Qué te parece si incluimos algunas imágenes o gráficos para respaldar las ideas presentadas?\\n\\nEn resumen, creo que con algunas mejoras en la gramática, ortografía, tono y estructura del texto podríamos lograr un resultado mucho más efectivo y atractivo para nuestros lectores.\""
          }
        },
        {
          "tipo": "resumir-texto",
          "cuerpo": {
            "Texto Resumido": "\"El texto original parece ser un conjunto de caracteres aleatorios sin sentido aparente. Sin embargo, puedo intentar analizarlo y generar un resumen conciso.\\n\\nDespués de analizar el texto, no se han encontrado puntos clave o conceptos significativos. El texto parece ser simplemente una secuencia de caracteres al azar.\\n\\nAquí te presento un posible resumen del texto original:\\n\\n\\\"El texto es una serie de caracteres aleatorios sin sentido aparente.\\\"\\n\\nNota que este resumen es aproximadamente el 25% de la longitud del texto original y se ajusta a las consideraciones proporcionadas.\""
          }
        }
      ]
    },
    {
      "usuario": "Yodak025",
      "fecha": "2025-04-25T17:52:39.414Z",
      "dirección": "diego.sota@gmail.com",
      "tarjeta": "11111212121212121212",
      "documentos": [
        {
          "tipo": "curriculum-vitae",
          "cuerpo": {
            "Currículum Vitae": {
              "Datos de Contacto": {
                "Nombre Completo": "Diego Sota ",
                "Dirección": "Avda. Abogados de Atocha, 6",
                "Teléfono": "646967576",
                "Correo Electrónico": "diego.sota@gmail.com"
              },
              "Perfil": "\"Soy Diego Sota, un profesional apasionado y con un alto nivel de motivación, lo que me permite mantener una actitud insaciable hacia mis objetivos profesionales.\\n\\nMi personalidad es la clave para entender mi enfoque en el trabajo: soy un jodido genio, capaz de encontrar soluciones innovadoras a los desafíos más complejos. Esta fortaleza me permite abordar proyectos con una visión creativa y una gran capacidad de resolución de problemas.\\n\\nMi perfil profesional se caracteriza por la búsqueda constante de excelencia en cada proyecto que emprenda, siempre buscando mejorar procesos y resultados.\"",
              "Experiencia Laboral": "\"\\\"Actualmente estoy en la etapa final de mi carrera como ingeniero de sistemas, lo que me proporciona una sólida base teórica y práctica en el campo de la tecnología y la informática.\\\\n\\\\nMi formación académica se centra en la adquisición de habilidades y conocimientos en áreas específicas como programación, redes de computadoras, bases de datos y sistemas operativos, entre otras.\\\"\"",
              "Formación Académica": "\"\\\"Estoy a punto de graduarme como ingeniero de sistemas, lo que me proporciona una sólida base teórica y práctica en el campo de la tecnología y la informática.\\\\n\\\\nMi formación académica se centra en la adquisición de habilidades y conocimientos en áreas específicas como programación, redes de computadoras, bases de datos y sistemas operativos, entre otras.\\\\n\\\\nEstoy a punto de obtener un título oficial que acredita mi capacidad para diseñar, desarrollar y implementar soluciones informáticas eficientes y efectivas.\\\"\"",
              "Habilidades": "\"\\\"\\\\\\\"Como profesional capacitado, tengo una amplia gama de habilidades técnicas y blandas que me permiten desempeñar mi trabajo de manera efectiva.\\\\\\\\n\\\\\\\\nEn el ámbito técnico, soy capaz de programar en Python y desarrollar aplicaciones web. Además, poseo la capacidad de resolver problemas de manera eficiente y creativa.\\\\\\\\n\\\\\\\\nMi personalidad es muy atractiva para los clientes, ya que soy tranquilo, agradable y accesible. Tengo una actitud proactiva y estoy siempre dispuesto a echar una mano cuando se requiere. También tengo experiencia hablando en público y actuando en pequeños escenarios, lo que me permite comunicarme de manera efectiva con mis clientes y colegas.\\\\\\\\n\\\\\\\\nEn cuanto a mi comunicación internacional, puedo expresarme con fluidez en inglés y castellano, lo que me permite interactuar con clientes y colegas de diferentes partes del mundo.\\\\\\\"\\\"\""
            }
          }
        }
      ]
    }
  ]
}